
import '../model/news.dart';

List<News> newsLikes = [
  News(
      image: 'images/hed.webp',
      titel: 'هدست سامسونگ احتمالاً در ژوئن 2024 معرفی خواهد شد',
      summary:
          'ظاهراً سامسونگ به‌خاطر مشخصات فنی بهتر ازجمله نمایشگر پیشرفته‌تر هدست اپل ویژن پرو، تصمیم به عرضه دیرتر هدست  خود گرفته است',
      description: ' .با معرفی هدست واقعیت ترکیبی اپل ویژن پرو، حالا شرکت‌های مختلف ازجمله رقیب اصلی اپل، یعنی سامسونگ به‌دنبال ورود به این بازار هستند. حالا طبق شایعه‌ای جدید، هدست واقعیت گسترده یا  سامسونگ تا ژوئن 2024 معرفی نخواهد شد.نزدیک به دو هفته پیش اولین تصویر واقعی از نمونه اولیه هدست واقعیت گسترده سامسونگ به اینترنت راه پیدا کرد که باعث افزایش گمانه‌زنی‌ها درباره این محصول شد. به‌نظر می‌رسد کره‌ای‌ها به‌دنبال عرضه زودهنگام این هدست بودند، اما معرفی اپل ویژن پرو برنامه‌های آن‌ها را تغییر داده است',
      type: 'تکنولوژی',
      newsicon: 'images/dg.png',
      newsname: ' خبر گذاری دیجیاتو',
      time: ' سه روز قبل',
      hashtag: ['تکنولوژی', 'هدست', 'سامسونگ']),
  News(
      image: 'images/hal.webp',
      titel: 'حلقه‌ هوشمند چیست و چه قابلیت‌هایی دارد؟',
      summary:
          'حلقه‌های هوشمند، ابزارهایی کوچک با کاربردهای بزرگ هستند که ممکن است آینده وسایل پوشیدنی را رقم بزنند',
      description: 'تصور کنید که هر روز حلقه‌‌‌ای را دست کنید که فعالیت روزانه شما را ثبت کرده، درها را برایتان باز کند و حتی هزینه قهوه‌ی صبحگاهی‌تان را بپردازد. شاید این چیزها شبیه به فیلم‌های علمی تخیلی به نظر برسند؛ اما به لطف ظهور حلقه‌های هوشمند، این سناریو چندان هم دور از واقعیت نیست از ثبت فعالیت‌های روزانه گرفته تا انجام پرداخت‌ها، این گجت‌های پیشرفته با حسگرها، تراشه‌ها و تجهیزات ارتباطی مینیاتوری خود، جان تازه‌‌ای به دنیای پوشیدنی‌ها داده‌اند اگر در مورد چگونگی کارکرد این دستگاه‌های کوچک و قابلیت‌های آن‌ها کنجکاوید، در این مقاله ما را همراهی کنید.',
      type: 'تکنولوژی',
      newsicon: 'images/zo.png',
      newsname: ' خبر گذاری زومیت',
      time: ' پنج روز قبل',
      hashtag: ['تکنولوژی', 'گجت', 'فناوری']),
  News(
      image: 'images/cart.webp',
      titel: 'مشکلات شایع کارت گرافیک و راه‌‌‌هایی برای رفع اشکال آن‌ها',
      summary:
          'سیاه‌شدن صفحه،‌ بهم‌ریختگی تصویر،‌ کارایی ضعیف، داغ کردن و صدا‌های غیرمعمول؛ اگر این مشکلات دامن‌گیر کارت گرافیک شما شده، این مقاله برای شما است',
      description: ' اگر گیمر و تدوین‌گر ویدیو هستید یا کارتان نیاز به کارت گرافیک مستقل دارد‌ قطعاً‌ از نقش حیاتی پردازنده‌ گرافیکی  سیستم در ارائه‌ی یک تجربه‌ی دیداری چشم‌نواز و روان با‌خبر هستید؛‌ اما درست مثل هر سخت‌افزار پیچیده‌ی دیگری، این قطعات نیز ممکن است با مشکلاتی رو‌به‌رو شوند و در نتیجه، سلامت روانی شما را به چالش بکشند. بسیاری از کاربران هنگام مواجهه با این مشکلات، می‌ترسند و از بهترین راه‌های مقابله با این ترس، کسب دانش رفع اشکال این قطعه‌ی مهم و اغلب گران‌قیمت است در این مقاله‌ زومیت، به بررسی پنج ایراد شایع در پردازنده‌های گرافیکی می‌پردازیم: سیاه‌شدن صفحه،‌ ناهنجاری‌‌های تصویری،‌ کارایی ضعیف، داغ کردن و صدا‌های غیرمعمول. به نوبت هرکدام از این مشکلات را کنکاش کرده و پس از توضیح اهمیت هرکدام، راه‌‌حل‌هایی عملی برای رفع آن‌ها ارائه می‌دهیم',
      type: 'تکنولوژی',
      newsicon: 'images/zo.png',
      newsname: ' خبر گذاری زومیت',
      time: ' یک روز قبل',
      hashtag: ['سخت افزار', 'پردازنده گرافیکی', 'فناوری']),
];
