import 'package:flutter/material.dart';

import '../model/news.dart';


List<News> newsHots = [
  News(
      image: 'images/ta.jpg',
      titel: 'مهدی طارمی تور میلان را تکان می دهد',
      summary:
          'با صحبت‌های شب گذشته استفانو پیولی مشخص است که باشگاه میلان عزم خود را برای جذب مهدی طارمی جزم کرده است',
      description: 'روزنامه ایتالیایی گاتزتا دلا اسپورت که یک خبرنگار ویژه را برای موضوع انتقال طارمی از پورتو بالای میز خبر میلان گذاشته، درباره این مسئله نوشته است: «بازار نقل و انتقالات میلان هنوز تمام نشده. استفانو پیولی فاقد مهاجمی است که بتواند جایگزین الیویه ژیرو در طول مسابقه بشود و در مرکز مثلث تهاجمی روسونری حرکت کند. نامی که توسط مدیریت تایید شده، مهدی طارمی 31 ساله است. در پورتو حضور دارد و به خاطر گلزنی های فوق العاده‌اش در اروپا شناخته می‌شود. او در ابتدای بازار نقل و انتقالاتی هم پیش از روی آوردن میلان به نوآ اوکافور مورد توجه روسونری بود، اما به مرور این درخواست رو به سردی گرایید.»',
      type: 'ورزشی',
      newsicon: 'images/va.png',
      newsname: ' خبر گذاری ورزش سه',
      time: ' پنج دقیه قبل',
      hashtag: ['ورزشی', 'طارمی', 'پورتو']),
  News(
      image: 'images/val.jpg',
      titel: 'تصمیم‌نهایی درباره کادر فنی تیم‌ملی‌والیبال',
      summary:
          'جایی که در فاصله دو ماه، یک بار دیگر با نتیجه سه به صفر مقابل ژاپن شکست خوردیم',
      description: 'بعد از این ناکامی و با توجه به از دست دادن امتیاز بالای این مسابقات در رنکینگ، طبیعتاً شانس تیم ملی والیبال ایران برای رفتن به المپیک پاریس کاهش یافته است. حالا بعد از این جز بازی‌های آسیایی که شاید فقط مدالش اهمیت دارد، مسابقات انتخابی المپیک پیش روی تیم ملی ایران است که با توجه به گروه سختمان و البته وضعیت تیم خیلی بعید به نظر می‌رسد که بتوانیم از این طریق جواز حضور در المپیک را کسب کنیم.',
      type: 'ورزشی',
      newsicon: 'images/va.png',
      newsname: ' خبر گذاری ورزش سه',
      time: ' ده دقیه قبل',
      hashtag: ['ورزشی', 'والیبال', 'تیم ملی ایران']),
  News(
      image: 'images/naz.webp',
      titel: 'فضاپیمای ناسا به فرماندهی یاسمین مقبلی به فضا پرتاب شد',
      summary:
          'فضاپیمای "کرو دراگون اندورنس" با راکت فالکون۹ شرکت اسپیس‌ایکس به ایستگاه فضایی بین‌المللی پرتاب شد ',
      description: ' اسپیس ایکس خدمه ماموریت کرو ۷ شامل یاسمین مقبلی و سه فضانورد دیگر را با موفقیت برفراز موشک فالکون ۹ به فضا پرتاب کرد. فضانوردان بیش از ۲۴ ساعت آینده را در فضا خواهند گذراند و فردا یکشنبه در حوالی ساعت ۱۶:۰۹ به وقت ایران به ایستگاه فضایی بین‌المللی متصل خواهند شد.',
      type: 'علمی',
      newsicon: 'images/zo.png',
      newsname: ' خبر گذاری زومیت',
      time: ' یک ساعت قبل',
      hashtag: ['علمی', 'ناسا', 'یاسمین مقبلی']),
];

